#!/bin/bash

mostPopularHost=$(cat $1 | awk '{split($0, a, " - - "); print a[1]}' | sort | uniq -c | sort -rn | head -1)
callsNumber=$(echo $mostPopularHost | awk '{print $1}')
hostName=$(echo $mostPopularHost | awk '{print $2}')
cat $1 | grep $hostName | awk '{split($0, a, "\""); print a[2]}' | awk '{print $2}' | sort | uniq -c | sort -rn | head -10 | awk '{printf "http://%s%s - %d - %d%%\n", "'$hostName'", $2, $1, $1/'$callsNumber'*100 }'

# mostPopularHost - найпопулярніша url адреса та кількість її викликів
# cat $1 - вивести зміст усього файлу
# awk '{split($0, a, " - - "); print a[1]}' - розділити за рядком " - - " та отримати першу (ліву) частину
# sort - відсортувати вивід за алфавітом (однакові рядки будуть виводитись поряд)
# uniq -c - підрахувати кількість повторень рядків 
# sort -rn - відсортувати рядки за спаданням кількості повторень
# head -1 - вивести перший рядок
# приклад виводу:
# 420 google.com
# /\          /\
# ||          ||
# callsNumber hostName
#
# callsNumber - кількість викликів заданої url адреси
# awk '{print $1}' - розділити рядок за пробілами та отримати перший підрядок
#
# hostName - url адреса
# awk '{print $2}' - розділити рядок за пробілами та отримати другий підрядок
#
# вивід результату:
# cat $1 - вивести зміст усього файлу
# grep hostName - отримати тільки ті рядки, що містять заданий url 
# awk '{split($0, a, "\""); print a[2]}' - розділити за символом " та отримати другий підрядок (HTTP запит)
# awk '{print $2}' - розділити за пробілом та отримати другий підрядок (реферер)
# sort - відсортувати за алфавітом
# uniq -c - підрахувати кількість повторень рядків 
# sort -rn - відсортувати за спаданням кількості повторень
# head -10 - вивести перші 10 рядків
# awk '{printf "http://%s%s - %d - %d%%\n", "'$hostName'", $2, $1, $1/'$callsNumber'*100 }'
# вивести рядки в форматі http://<url адреса><реферер> - <кількість викликів реферера> - <відсоток від загальної кількості>
